// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",
        "心爱的小呆呆",
        "今天是你的生日",
        "陪你过的第四个生日了呦",
        "时间过的好快",
        "明明感觉我们仍像是刚在一起热恋的恋人",
        "但有时又感觉",
        "我们在一起了很久很久",
        "久到你就像是我最熟悉、最有默契的亲人",
        "我要谢谢你",
        "你让我这个有点点理智，有点点自我的人",
        "可以在你面前放下所有的戒备和你一起胡闹、傻笑",
        "可以看着你向我走来就能忘掉自己的劳累和烦恼",
        "甚至在将见到你的几个小时前就忍不住上扬嘴角",
        "我以前一定想不到",
        "你的委屈与抱怨可以让我一瞬间就乱了心绪",
        "你的不开心就是我的不开心",
        "因为我对于你的生活早就做不到置身事外",
        "因为你在我眼中早就是这么单纯、乐观、美好",
        "但我知道我还做的不够",
        "你给了我从没想过的快乐和爱",
        "我会用尽全力",
        "make you feel the same with me",
        




        "愿你",
        "在未来的日子里",
        "要更加乐观",
        "要积极锻炼",
        "要每天开心",
        "希望你能永远保持善良",
        "希望你能永远身体健康",
        "希望你能永远身边有我",
        "希望我能永远让你快乐",
        "生日快乐",
        "お诞生日おめでとうございます",
        "我的王晨小朋友"
        
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "心爱的小可爱": "./imgs/vicky1.jpg",
        "今天是你的生日": "./imgs/xiaokeai.png",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开灯~",
        play: "来点音乐~",
        // bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "一封给王晨小朋友的信",
    }
};
